zevorn/8051-ell/libraries/core/STC8Gx_REG.h
/* ISR register */
sfr IE   =   IE_ADDRESS;
sfr IE2  =  IE2_ADDRESS;
sfr IP   =   IP_ADDRESS;
sfr IPH  =  IPH_ADDRESS;
sfr IP2  = IP2H_ADDRESS;
sfr IP2H = IP2H_ADDRESS;
sfr IP3  =  IP3_ADDRESS;
sfr IP3H = IP3H_ADDRESS;
sfr INTCLKO  =  INTCLKO_ADDRESS;
sfr AUXINTIF = AUXINTIF_ADDRESS;

sbit EA   = IE^7;
sbit ELVD = IE^6;
sbit EADC = IE^5;
sbit ES   = IE^4;
sbit ET1  = IE^3;
sbit EX1  = IE^2;
sbit ET0  = IE^1;
sbit EX0  = IE^0;

sbit PPCA = IP^7;
sbit PLVD = IP^6;
sbit PADC = IP^5;
sbit PS   = IP^4;
sbit PT1  = IP^3;
sbit PX1  = IP^2;
sbit PT0  = IP^1;
sbit PX0  = IP^0;

#define    P0INTE    ( *(__IO uint8_t xdata *)   P0INTE_ADDRESS)
#define    P1INTE    ( *(__IO uint8_t xdata *)   P1INTE_ADDRESS)
#define    P2INTE    ( *(__IO uint8_t xdata *)   P2INTE_ADDRESS)
#define    P3INTE    ( *(__IO uint8_t xdata *)   P3INTE_ADDRESS)
#define    P4INTE    ( *(__IO uint8_t xdata *)   P4INTE_ADDRESS)
#define    P5INTE    ( *(__IO uint8_t xdata *)   P5INTE_ADDRESS)

#define    P0INTF    ( *(__IO uint8_t xdata *)   P0INTF_ADDRESS)
#define    P1INTF    ( *(__IO uint8_t xdata *)   P1INTF_ADDRESS)
#define    P2INTF    ( *(__IO uint8_t xdata *)   P2INTF_ADDRESS)
#define    P3INTF    ( *(__IO uint8_t xdata *)   P3INTF_ADDRESS)
#define    P4INTF    ( *(__IO uint8_t xdata *)   P4INTF_ADDRESS)
#define    P5INTF    ( *(__IO uint8_t xdata *)   P5INTF_ADDRESS)

/*--------------------------------------------------------
| @Description: GPIO peripherals                         |
--------------------------------------------------------*/

/* Base address define */
#define    GPIO_BASE       0x80U
#define    PxM1_BASE       0x93U
#define    PxM0_BASE       0x94U
#define BUS_SPEED_ADDRESS  0xA1U

/* There are internal extended 
ram areas below */
#define    PxPU_BASE     0xFE10U
#define    PxNCS_BASE    0xFE18U
#define    PxSR_BASE     0xFE20U
#define    PxDR_BASE     0xFE28U
#define    PxIE_BASE     0xFE30U

/* GPIO address define */
#define    GPIO_P0_ADDRESS  GPIO_BASE 
#define    GPIO_P1_ADDRESS      0x90U 
#define    GPIO_P2_ADDRESS      0xA0U
#define    GPIO_P3_ADDRESS      0xB0U 
#define    GPIO_P4_ADDRESS      0xC0U
#define    GPIO_P5_ADDRESS      0xC8U 

/*PxMx address define*/
#define    P0M1_ADDRESS  PxM1_BASE
#define    P1M1_ADDRESS      0x91U
#define    P2M1_ADDRESS      0x95U
#define    P3M1_ADDRESS      0xB1U
#define    P4M1_ADDRESS      0xB3U
#define    P5M1_ADDRESS      0xC9U
				 							    
#define    P0M0_ADDRESS  PxM0_BASE
#define    P1M0_ADDRESS      0x92U
#define    P2M0_ADDRESS      0x96U
#define    P3M0_ADDRESS      0xB2U
#define    P4M0_ADDRESS      0xB4U
#define    P5M0_ADDRESS      0xCAU

/*GPIO pull up address */
#define    P0PU_ADDRESS    (PxPU_BASE + 0x00U)
#define    P1PU_ADDRESS    (PxPU_BASE + 0x01U)
#define    P2PU_ADDRESS    (PxPU_BASE + 0x02U)
#define    P3PU_ADDRESS    (PxPU_BASE + 0x03U)
#define    P4PU_ADDRESS    (PxPU_BASE + 0x04U)
#define    P5PU_ADDRESS    (PxPU_BASE + 0x05U)

#define    GPIO_P0PU_ADDRESS    (PxPU_BASE + 0x00U)
#define    GPIO_P1PU_ADDRESS    (PxPU_BASE + 0x01U)
#define    GPIO_P2PU_ADDRESS    (PxPU_BASE + 0x02U)
#define    GPIO_P3PU_ADDRESS    (PxPU_BASE + 0x03U)
#define    GPIO_P4PU_ADDRESS    (PxPU_BASE + 0x04U)
#define    GPIO_P5PU_ADDRESS    (PxPU_BASE + 0x05U)

/*GPIO schmidt trigger address */
#define    P0NCS_ADDRESS   (PxNCS_BASE + 0x00U)
#define    P1NCS_ADDRESS   (PxNCS_BASE + 0x01U)
#define    P2NCS_ADDRESS   (PxNCS_BASE + 0x02U)
#define    P3NCS_ADDRESS   (PxNCS_BASE + 0x03U)
#define    P4NCS_ADDRESS   (PxNCS_BASE + 0x04U)
#define    P5NCS_ADDRESS   (PxNCS_BASE + 0x05U)

#define    GPIO_P0NCS_ADDRESS   (PxNCS_BASE + 0x00U)
#define    GPIO_P1NCS_ADDRESS   (PxNCS_BASE + 0x01U)
#define    GPIO_P2NCS_ADDRESS   (PxNCS_BASE + 0x02U)
#define    GPIO_P3NCS_ADDRESS   (PxNCS_BASE + 0x03U)
#define    GPIO_P4NCS_ADDRESS   (PxNCS_BASE + 0x04U)
#define    GPIO_P5NCS_ADDRESS   (PxNCS_BASE + 0x05U)

/* GPIO level conversion address */
#define    P0SR_ADDRESS    (PxSR_BASE + 0x00U)
#define    P1SR_ADDRESS    (PxSR_BASE + 0x01U)
#define    P2SR_ADDRESS    (PxSR_BASE + 0x02U)
#define    P3SR_ADDRESS    (PxSR_BASE + 0x03U)
#define    P4SR_ADDRESS    (PxSR_BASE + 0x04U)
#define    P5SR_ADDRESS    (PxSR_BASE + 0x05U)

#define    GPIO_P0SR_ADDRESS    (PxSR_BASE + 0x00U)
#define    GPIO_P1SR_ADDRESS    (PxSR_BASE + 0x01U)
#define    GPIO_P2SR_ADDRESS    (PxSR_BASE + 0x02U)
#define    GPIO_P3SR_ADDRESS    (PxSR_BASE + 0x03U)
#define    GPIO_P4SR_ADDRESS    (PxSR_BASE + 0x04U)
#define    GPIO_P5SR_ADDRESS    (PxSR_BASE + 0x05U)

/* GPIO drive current address */
#define    P0DR_ADDRESS    (PxDR_BASE + 0x00U)
#define    P1DR_ADDRESS    (PxDR_BASE + 0x01U)
#define    P2DR_ADDRESS    (PxDR_BASE + 0x02U)
#define    P3DR_ADDRESS    (PxDR_BASE + 0x03U)
#define    P4DR_ADDRESS    (PxDR_BASE + 0x04U)
#define    P5DR_ADDRESS    (PxDR_BASE + 0x05U)

#define    GPIO_P0DR_ADDRESS    (PxDR_BASE + 0x00U)
#define    GPIO_P1DR_ADDRESS    (PxDR_BASE + 0x01U)
#define    GPIO_P2DR_ADDRESS    (PxDR_BASE + 0x02U)
#define    GPIO_P3DR_ADDRESS    (PxDR_BASE + 0x03U)
#define    GPIO_P4DR_ADDRESS    (PxDR_BASE + 0x04U)
#define    GPIO_P5DR_ADDRESS    (PxDR_BASE + 0x05U)


/* GPIO intput enable address*/
#define    P0IE_ADDRESS    (PxIE_BASE + 0x00U)
#define    P1IE_ADDRESS    (PxIE_BASE + 0x01U)
#define    P3IE_ADDRESS    (PxIE_BASE + 0x03U)

/* GPIO register */
sfr P0 = GPIO_P0_ADDRESS;
sfr P1 = GPIO_P1_ADDRESS;
sfr P2 = GPIO_P2_ADDRESS;
sfr P3 = GPIO_P3_ADDRESS;
sfr P4 = GPIO_P4_ADDRESS;
sfr P5 = GPIO_P5_ADDRESS;


sfr GPIO_P0_IO = GPIO_P0_ADDRESS;
sfr GPIO_P1_IO = GPIO_P1_ADDRESS;
sfr GPIO_P2_IO = GPIO_P2_ADDRESS;
sfr GPIO_P3_IO = GPIO_P3_ADDRESS;
sfr GPIO_P4_IO = GPIO_P4_ADDRESS;
sfr GPIO_P5_IO = GPIO_P5_ADDRESS;

/* GPIO register */
sbit P00 = P0^0;
sbit P01 = P0^1;
sbit P02 = P0^2;
sbit P03 = P0^3;
sbit P04 = P0^4;
sbit P05 = P0^5;
sbit P06 = P0^6;
sbit P07 = P0^7;

/* Pin register */
sbit P10 = P1^0;
sbit P11 = P1^1;
sbit P12 = P1^2;
sbit P13 = P1^3;
sbit P14 = P1^4;
sbit P15 = P1^5;
sbit P16 = P1^6;
sbit P17 = P1^7;
						
sbit P20 = P2^0;
sbit P21 = P2^1;
sbit P22 = P2^2;
sbit P23 = P2^3;
sbit P24 = P2^4;
sbit P25 = P2^5;
sbit P26 = P2^6;
sbit P27 = P2^7;
					 
sbit P30 = P3^0;
sbit P31 = P3^1;
sbit P32 = P3^2;
sbit P33 = P3^3;
sbit P34 = P3^4;
sbit P35 = P3^5;
sbit P36 = P3^6;
sbit P37 = P3^7;
						
sbit P40 = P4^0;
sbit P41 = P4^1;
sbit P42 = P4^2;
sbit P43 = P4^3;
sbit P44 = P4^4;
						
sbit P50 = P5^0;
sbit P51 = P5^1;
sbit P52 = P5^2;
sbit P53 = P5^3;
sbit P54 = P5^4;
sbit P55 = P5^5;
sbit P56 = P5^6;
sbit P57 = P5^7;

